<?php
// Heading
$_['heading_title']                = 'Авторизация';

// Text
$_['text_account']                 = 'Личный Кабинет';
$_['text_login']                   = 'Авторизация';
$_['text_new_customer']            = 'Новый клиент';
$_['text_register']                = 'Регистрация';
$_['text_register_account']        = 'Создание учетной записи поможет покупать быстрее. Вы сможете контролировать состояние заказа, а также просматривать заказы сделанные ранее. Вы сможете накапливать призовые баллы и получать скидочные купоны. <BR>А постоянным покупателям мы предлагаем гибкую систему скидок и персональное обслуживание.<BR>';
$_['text_returning_customer']      = 'Зарегистрированный клиент';
$_['text_i_am_returning_customer'] = 'Войти в Личный Кабинет';
$_['text_forgotten']               = 'Забыли пароль?';
//Register
$_['text_account_already']         = 'Если Вы уже зарегистрированы, перейдите на страницу <a href="%s">авторизации</a>.';
$_['text_your_details']            = 'Основные данные';
$_['text_newsletter']              = 'Рассылка новостей';
$_['text_your_password']           = 'Ваш пароль';
$_['text_agree']                   = 'Нажимая кнопку "Регистрация", я подтверждаю свою дееспособность, даю согласие на хранение и обработку моих персональных данных в соответствии с <a href="index.php?route=information/information/agree&information_id=3" class="agree"><i>политикой безопасности</i></a> данного сайта.';


// Entry
$_['entry_email']                  = 'E-Mail';
$_['entry_password']               = 'Пароль';
$_['entry_customer_group']         = 'Направление бизнеса';
$_['entry_firstname']              = 'Имя';
$_['entry_lastname']               = 'Фамилия';
$_['entry_middlename']             = 'Отчество';
$_['entry_telephone']              = 'Телефон';
$_['entry_newsletter']             = 'Подписка на новости';
$_['entry_confirm']                = 'Подтверждение пароля';


// Error
$_['error_login']                  = 'Неправильно e-mail / или пароль!';
$_['error_attempts']               = 'Вы превысили максимальное количество попыток авторизации. Повторите попытку авторизации на сайте через 1 час';
$_['error_approved']               = 'Необходимо подтвердить аккаунт перед авторизацией.';
$_['error_exists']                 = 'Данный E-Mail уже зарегистрирован!';
$_['error_firstname']              = 'Имя должно быть не менее 2-х символов русского алфавита!';
$_['error_lastname']               = 'Фамилия должна быть не менее 2-х символов русского алфавита!';
$_['error_middlename']             = 'Отчество должно быть не менее 2-х символов русского алфавита!';
$_['error_email']                  = 'Не валидный e-mail, введен неправильно!';
$_['error_telephone']              = 'Телефон должен быть от 10 до 12 цифр!';
$_['error_custom_field']           = '%s обязательно к заполнению!';
$_['error_password']               = 'В пароле должно быть от 4 до 20 символов!';
$_['error_confirm']                = 'Пароли и пароль подтверждения не совпадают!';
$_['error_agree']                  = 'Вы должны прочитать и согласится!';